Revit 2027 API
ExternalDataManagerDataItem Methods
The ExternalDataManagerDataItem type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetId |  Gets the id of the data item.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetId |  Sets the id of the data item.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace